name: "VGG_ILSVRC_16_layer"
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    crop_size: 224
    mean_value: 103.939
    mean_value: 116.779
    mean_value: 123.68
  }
  data_param {
    source: "imagenet/ilsvrc12_train_lmdb"
    batch_size: 5
    backend: LMDB
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    crop_size: 224
    mean_value: 103.939
    mean_value: 116.779
    mean_value: 123.68
  }
  data_param {
    source: "imagenet/ilsvrc12_val_lmdb"
    batch_size: 5
    backend: LMDB
  }
}

layer {
  name: "conv1_1"
  type: "Convolution"
  bottom: "data"
  top: "conv1_1"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.2
    decay_mult: 0
  }
}
layer {
  name: "relu1_1"
  type: "ReLU"
  bottom: "conv1_1"
  top: "conv1_1"
}

layer {
  name: "conv1_2_kh"
  type: "Convolution"
  bottom: "conv1_1"
  top: "conv1_2_kh"
  convolution_param {
    num_output: 64
    pad_h: 1
    pad_w: 0
    kernel_h: 3
    kernel_w: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.2
    decay_mult: 0
  }
}
layer {
  name: "conv1_2_kw_a"
  type: "Convolution"
  bottom: "conv1_2_kh"
  top: "conv1_2_kw_a"
  convolution_param {
    num_output: 11
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 3
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.2
    decay_mult: 0
  }
}
layer {
  name: "conv1_2_kw_b"
  type: "Convolution"
  bottom: "conv1_2_kw_a"
  top: "conv1_2_kw_b"
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.2
    decay_mult: 0
  }
}
layer {
  name: "relu1_2"
  type: "ReLU"
  bottom: "conv1_2_kw_b"
  top: "conv1_2_kw_b"
}

layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1_2_kw_b"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layer {
  name: "conv2_1_kh"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2_1_kh"
  convolution_param {
    num_output: 128
    pad_h: 1
    pad_w: 0
    kernel_h: 3
    kernel_w: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.2
    decay_mult: 0
  }
}
layer {
  name: "conv2_1_kw_a"
  type: "Convolution"
  bottom: "conv2_1_kh"
  top: "conv2_1_kw_a"
  convolution_param {
    num_output: 25
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 3
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.2
    decay_mult: 0
  }
}
layer {
  name: "conv2_1_kw_b"
  type: "Convolution"
  bottom: "conv2_1_kw_a"
  top: "conv2_1_kw_b"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.2
    decay_mult: 0
  }
}
layer {
  name: "relu2_1"
  type: "ReLU"
  bottom: "conv2_1_kw_b"
  top: "conv2_1_kw_b"
}

layer {
  name: "conv2_2_kh"
  type: "Convolution"
  bottom: "conv2_1_kw_b"
  top: "conv2_2_kh"
  convolution_param {
    num_output: 128
    pad_h: 1
    pad_w: 0
    kernel_h: 3
    kernel_w: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.2
    decay_mult: 0
  }
}
layer {
  name: "conv2_2_kw_a"
  type: "Convolution"
  bottom: "conv2_2_kh"
  top: "conv2_2_kw_a"
  convolution_param {
    num_output: 28
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 3
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.2
    decay_mult: 0
  }
}
layer {
  name: "conv2_2_kw_b"
  type: "Convolution"
  bottom: "conv2_2_kw_a"
  top: "conv2_2_kw_b"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.2
    decay_mult: 0
  }
}
layer {
  name: "relu2_2"
  type: "ReLU"
  bottom: "conv2_2_kw_b"
  top: "conv2_2_kw_b"
}

layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2_2_kw_b"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layer {
  name: "conv3_1_kh"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3_1_kh"
  convolution_param {
    num_output: 256
    pad_h: 1
    pad_w: 0
    kernel_h: 3
    kernel_w: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.2
    decay_mult: 0
  }
}
layer {
  name: "conv3_1_kw_a"
  type: "Convolution"
  bottom: "conv3_1_kh"
  top: "conv3_1_kw_a"
  convolution_param {
    num_output: 52
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 3
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.2
    decay_mult: 0
  }
}
layer {
  name: "conv3_1_kw_b"
  type: "Convolution"
  bottom: "conv3_1_kw_a"
  top: "conv3_1_kw_b"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.2
    decay_mult: 0
  }
}
layer {
  name: "relu3_1"
  type: "ReLU"
  bottom: "conv3_1_kw_b"
  top: "conv3_1_kw_b"
}

layer {
  name: "conv3_2_kh"
  type: "Convolution"
  bottom: "conv3_1_kw_b"
  top: "conv3_2_kh"
  convolution_param {
    num_output: 256
    pad_h: 1
    pad_w: 0
    kernel_h: 3
    kernel_w: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.2
    decay_mult: 0
  }
}
layer {
  name: "conv3_2_kw_a"
  type: "Convolution"
  bottom: "conv3_2_kh"
  top: "conv3_2_kw_a"
  convolution_param {
    num_output: 46
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 3
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.2
    decay_mult: 0
  }
}
layer {
  name: "conv3_2_kw_b"
  type: "Convolution"
  bottom: "conv3_2_kw_a"
  top: "conv3_2_kw_b"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.2
    decay_mult: 0
  }
}
layer {
  name: "relu3_2"
  type: "ReLU"
  bottom: "conv3_2_kw_b"
  top: "conv3_2_kw_b"
}

layer {
  name: "conv3_3_kh"
  type: "Convolution"
  bottom: "conv3_2_kw_b"
  top: "conv3_3_kh"
  convolution_param {
    num_output: 256
    pad_h: 1
    pad_w: 0
    kernel_h: 3
    kernel_w: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.2
    decay_mult: 0
  }
}
layer {
  name: "conv3_3_kw_a"
  type: "Convolution"
  bottom: "conv3_3_kh"
  top: "conv3_3_kw_a"
  convolution_param {
    num_output: 56
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 3
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.2
    decay_mult: 0
  }
}
layer {
  name: "conv3_3_kw_b"
  type: "Convolution"
  bottom: "conv3_3_kw_a"
  top: "conv3_3_kw_b"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.2
    decay_mult: 0
  }
}
layer {
  name: "relu3_3"
  type: "ReLU"
  bottom: "conv3_3_kw_b"
  top: "conv3_3_kw_b"
}

layer {
  name: "pool3"
  type: "Pooling"
  bottom: "conv3_3_kw_b"
  top: "pool3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layer {
  name: "conv4_1_kh"
  type: "Convolution"
  bottom: "pool3"
  top: "conv4_1_kh"
  convolution_param {
    num_output: 512
    pad_h: 1
    pad_w: 0
    kernel_h: 3
    kernel_w: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.2
    decay_mult: 0
  }
}
layer {
  name: "conv4_1_kw_a"
  type: "Convolution"
  bottom: "conv4_1_kh"
  top: "conv4_1_kw_a"
  convolution_param {
    num_output: 104
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 3
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.2
    decay_mult: 0
  }
}
layer {
  name: "conv4_1_kw_b"
  type: "Convolution"
  bottom: "conv4_1_kw_a"
  top: "conv4_1_kw_b"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.2
    decay_mult: 0
  }
}
layer {
  name: "relu4_1"
  type: "ReLU"
  bottom: "conv4_1_kw_b"
  top: "conv4_1_kw_b"
}

layer {
  name: "conv4_2_kh"
  type: "Convolution"
  bottom: "conv4_1_kw_b"
  top: "conv4_2_kh"
  convolution_param {
    num_output: 512
    pad_h: 1
    pad_w: 0
    kernel_h: 3
    kernel_w: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.2
    decay_mult: 0
  }
}
layer {
  name: "conv4_2_kw_a"
  type: "Convolution"
  bottom: "conv4_2_kh"
  top: "conv4_2_kw_a"
  convolution_param {
    num_output: 92
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 3
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.2
    decay_mult: 0
  }
}
layer {
  name: "conv4_2_kw_b"
  type: "Convolution"
  bottom: "conv4_2_kw_a"
  top: "conv4_2_kw_b"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.2
    decay_mult: 0
  }
}
layer {
  name: "relu4_2"
  type: "ReLU"
  bottom: "conv4_2_kw_b"
  top: "conv4_2_kw_b"
}

layer {
  name: "conv4_3_kh"
  type: "Convolution"
  bottom: "conv4_2_kw_b"
  top: "conv4_3_kh"
  convolution_param {
    num_output: 512
    pad_h: 1
    pad_w: 0
    kernel_h: 3
    kernel_w: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.2
    decay_mult: 0
  }
}
layer {
  name: "conv4_3_kw_a"
  type: "Convolution"
  bottom: "conv4_3_kh"
  top: "conv4_3_kw_a"
  convolution_param {
    num_output: 100
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 3
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.2
    decay_mult: 0
  }
}
layer {
  name: "conv4_3_kw_b"
  type: "Convolution"
  bottom: "conv4_3_kw_a"
  top: "conv4_3_kw_b"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.2
    decay_mult: 0
  }
}
layer {
  name: "relu4_3"
  type: "ReLU"
  bottom: "conv4_3_kw_b"
  top: "conv4_3_kw_b"
}

layer {
  name: "pool4"
  type: "Pooling"
  bottom: "conv4_3_kw_b"
  top: "pool4"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layer {
  name: "conv5_1_kh"
  type: "Convolution"
  bottom: "pool4"
  top: "conv5_1_kh"
  convolution_param {
    num_output: 512
    pad_h: 1
    pad_w: 0
    kernel_h: 3
    kernel_w: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.2
    decay_mult: 0
  }
}
layer {
  name: "conv5_1_kw_a"
  type: "Convolution"
  bottom: "conv5_1_kh"
  top: "conv5_1_kw_a"
  convolution_param {
    num_output: 232
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 3
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.2
    decay_mult: 0
  }
}
layer {
  name: "conv5_1_kw_b"
  type: "Convolution"
  bottom: "conv5_1_kw_a"
  top: "conv5_1_kw_b"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.2
    decay_mult: 0
  }
}
layer {
  name: "relu5_1"
  type: "ReLU"
  bottom: "conv5_1_kw_b"
  top: "conv5_1_kw_b"
}

layer {
  name: "conv5_2_kh"
  type: "Convolution"
  bottom: "conv5_1_kw_b"
  top: "conv5_2_kh"
  convolution_param {
    num_output: 512
    pad_h: 1
    pad_w: 0
    kernel_h: 3
    kernel_w: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.2
    decay_mult: 0
  }
}
layer {
  name: "conv5_2_kw_a"
  type: "Convolution"
  bottom: "conv5_2_kh"
  top: "conv5_2_kw_a"
  convolution_param {
    num_output: 224
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 3
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.2
    decay_mult: 0
  }
}
layer {
  name: "conv5_2_kw_b"
  type: "Convolution"
  bottom: "conv5_2_kw_a"
  top: "conv5_2_kw_b"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.2
    decay_mult: 0
  }
}
layer {
  name: "relu5_2"
  type: "ReLU"
  bottom: "conv5_2_kw_b"
  top: "conv5_2_kw_b"

}

layer {
  name: "conv5_3_kh"
  type: "Convolution"
  bottom: "conv5_2_kw_b"
  top: "conv5_3_kh"
  convolution_param {
    num_output: 512
    pad_h: 1
    pad_w: 0
    kernel_h: 3
    kernel_w: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.2
    decay_mult: 0
  }
}
layer {
  name: "conv5_3_kw_a"
  type: "Convolution"
  bottom: "conv5_3_kh"
  top: "conv5_3_kw_a"
  convolution_param {
    num_output: 214
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 3
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.2
    decay_mult: 0
  }
}
layer {
  name: "conv5_3_kw_b"
  type: "Convolution"
  bottom: "conv5_3_kw_a"
  top: "conv5_3_kw_b"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
  }
  param {
    lr_mult: 0.1
    decay_mult: 1
  }
  param {
    lr_mult: 0.2
    decay_mult: 0
  }
}
layer {
  name: "relu5_3"
  type: "ReLU"
  bottom: "conv5_3_kw_b"
  top: "conv5_3_kw_b"
}

layer {
  name: "pool5"
  type: "Pooling"
  bottom: "conv5_3_kw_b"
  top: "pool5"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layer {
  name: "fc6"
  type: "InnerProduct"
  bottom: "pool5"
  top: "fc6"
  inner_product_param {
    num_output: 4096
  }
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
}
layer {
  name: "relu6"
  type: "ReLU"
  bottom: "fc6"
  top: "fc6"
}
layer {
  name: "drop6"
  type: "Dropout"
  bottom: "fc6"
  top: "fc6"
  dropout_param {
    dropout_ratio: 0.5
  }
}

layer {
  name: "fc7"
  type: "InnerProduct"
  bottom: "fc6"
  top: "fc7"
  inner_product_param {
    num_output: 4096
  }
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
}
layer {
  name: "relu7"
  type: "ReLU"
  bottom: "fc7"
  top: "fc7"
}
layer {
  name: "drop7"
  type: "Dropout"
  bottom: "fc7"
  top: "fc7"
  dropout_param {
    dropout_ratio: 0.5
  }
}

layer {
  name: "fc8"
  type: "InnerProduct"
  bottom: "fc7"
  top: "fc8"
  inner_product_param {
    num_output: 1000
  }
}

layer {
  bottom: "fc8"
  bottom: "label"
  top: "accuracy"
  name: "accuracy"
  type: "Accuracy"
  include {
    phase: TEST
  }
}
layer {
  bottom: "fc8"
  bottom: "label"
  top: "loss"
  name: "loss"
  type: "SoftmaxWithLoss"
}
